oskarbjo/NRF52/ble_transmit_SPI_52820/pca10100/s140/ses/main.c
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        NRF_LOG_INFO("Disconnecting...");

        ret_code_t err_code;
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("sd_ble_gap_disconnect() failed: 0x%0x.", err_code);
        }
    }
    else
    {
        if (m_board_role == BOARD_DUMMY)
        {
            if (m_gap_role == BLE_GAP_ROLE_PERIPH)
            {
                advertising_start();
            }
            else
            {
                //scan_start();
            }
        }
    }
}





void spi_event_handler(nrf_drv_spi_evt_t const * p_event,
                       void *                    p_context)
{
    spi_xfer_done = true;
    //NRF_LOG_INFO("Transfer completed.");
    //if (m_rx_buf[0] != 0)
    //{
    //    NRF_LOG_INFO(" Received:");
    //    NRF_LOG_HEXDUMP_INFO(m_rx_buf, strlen((const char *)m_rx_buf));
    //}
}

void send_SPI_RX_buf(nrf_ble_amts_t * p_ctx){


    char *data = output_buffer;
    //for(int kk=0;kk<sizeof(data);kk++){
    //  NRF_LOG_INFO("Data sent %d: %d",kk,data[kk]);
    //}
    //uint16_t           payload_len = p_ctx->max_payload_len;
    uint16_t payload_len = sizeof(output_buffer);
    nrf_ble_amts_evt_t evt;

    ble_gatts_hvx_params_t const hvx_param =
    {
        .type   = BLE_GATT_HVX_NOTIFICATION,
        .handle = p_ctx->amts_char_handles.value_handle,
        .p_data = data,
        .p_len  = &payload_len,
    };

    uint32_t err_code = NRF_SUCCESS;

    //NRF_LOG_INFO("Sending data...");
    err_code = sd_ble_gatts_hvx(p_ctx->conn_handle, &hvx_param);

    if (err_code == NRF_ERROR_RESOURCES)
    {
        // Wait for BLE_GATTS_EVT_HVN_TX_COMPLETE.
        p_ctx->busy = true;
    }
    else if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("sd_ble_gatts_hvx() failed: 0x%x", err_code);
        return;
    }
    //NRF_LOG_INFO("Data successfully transmitted");


}


void readAccelerometer(){
           //nrf_drv_spi_transfer(&spi, m_tx_buf2, 1, m_rx_buf, 2);
          nrf_drv_spi_transfer(&spi, m_tx_buf_ACC,7, m_rx_buf_ACC,7);
          while(!spi_xfer_done){}
          spi_xfer_done=false;
          output_buffer[6]=0; //identifier for each board
          for(int i=0;i<6;i++){
            output_buffer[i] = m_rx_buf_ACC[i+1];
          }

}


bool newAccDataAvailable(){
   bool dataIsAvailable = false;

   nrf_drv_spi_transfer(&spi, m_tx_buf0, 1, m_rx_buf, 2);
   while(!spi_xfer_done){}
   spi_xfer_done=false;
   if((m_rx_buf[1] & 0x01) == 0x01){
      dataIsAvailable=true;
   }
   return dataIsAvailable;

}

void gpio_init(void)
{
    //Pins as outputs:
    nrf_gpio_range_cfg_output(8, 8);		
}

void toggleIOpin(){
nrf_gpio_pin_write(GPIO_PIN_8, GPIO_state);
            if(GPIO_state==1){
            GPIO_state = 0;
            }
            else{GPIO_state = 1;}
}

int main(void)
{
    // Initialize.

    log_init();
    timer_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_data_set();
  
    server_init();
  
    gatt_mtu_set(m_test_params.att_mtu);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
    advertising_start(); 

    gpio_init();
    
    ////SPI init:
    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin   = SPI_SS_PIN;
    spi_config.miso_pin = SPI_MISO_PIN;
    spi_config.mosi_pin = SPI_MOSI_PIN;
    spi_config.sck_pin  = SPI_SCK_PIN;
    spi_config.mode = NRF_DRV_SPI_MODE_0;
    spi_config.frequency = NRF_DRV_SPI_FREQ_2M; //2147483648 = 8MHz
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));



    ////Write SPI settings to IMU chip:
    nrf_drv_spi_transfer(&spi, m_tx_buf1, 2, m_rx_buf1, 2);
    while(!spi_xfer_done){}
    spi_xfer_done=false;

    uint32_t volatile delay_us = 100;
    int j = 0;
    m_run_test = false;
    
    



    // Enter main loop.
    for (;;)
    {     
     //idle_state_handle();

           //readAccelerometer();
            nrf_drv_spi_transfer(&spi, m_tx_buf1, 2, m_rx_buf1, 2);
            while(!spi_xfer_done){}
            spi_xfer_done=false;

     nrf_delay_us(delay_us);

     //if(is_test_ready()){
      //nrf_delay_us(delay_us);
      //send_SPI_RX_buf(&m_amts);
     //}
    }

}


/**
 * @}
 */
